<?php

return [
    '401' => 'ليس لديك صلاحيات الوصول لتلك الصفحه.',
    '402' => '',
    '403' => 'هناك الكثير من الطلبات ، برجاء المحاوله لاحقاََ.',
    '404' => 'هذا الرابط غير موجود.',
    '405' => '',
    '500' => 'هناك خطأ ما قد حدث برجاء التواصل مع الدعم الفني.',
    'nights' => '{1} ليلة واحدة|{2} ليلتين|{3,10} :count ليالي|[11,*] :count ليلة',
    'room_count' => '{1} غرفة|{2} غرفتين|{3,10} :count غرف|[11,*] :count غرفة',
    'persons_count' => '{1} شخص|{2} شخصين|{3,10} :count اشخاص|[11,*] :count شخص',
    'mabet_count' => '{1} مبيت|[2,*] :count مبيت'
];
